//SBGOLOBF JOB ,'SAM GOLOB',CLASS=B,
//    MSGCLASS=X,NOTIFY=&SYSUID
//*
//*   COMPARE TWO FILES UNDER WINDOW, PARMS
//*   TO RESTRICT THE WINDOW SIZE
//*
//CTFUWJ  EXEC PGM=CTFUW,PARM='10,30'
//STEPLIB  DD  DISP=SHR,DSN=SYS1.W$$.LINKLIB
//SYSPRINT DD  SYSOUT=*
//FILE1    DD  DISP=SHR,DSN=SBGOLOB.B.ASM(DACEE21)
//FILE2    DD  DISP=SHR,DSN=SBGOLOB.B.ASM(DACEE)
