//SBGOLOBC JOB ,'SAM GOLOB',CLASS=B,
//    MSGCLASS=X,NOTIFY=&SYSUID
//*
//*   CLEAR A PDS OF ALL ITS MEMBERS - CAREFUL !!!!
//*
//CLEARPDS EXEC PGM=PDSCLR
//STEPLIB  DD  DISP=SHR,DSN=SYS1.W$$.LINKLIB
//SYSLIB   DD  DISP=SHR,DSN=SBGOLOB.TESTCLR.PDS
