//SBGOLOBA  JOB (ACCT#),S-GOLOB,
// NOTIFY=&SYSUID,
// CLASS=B,MSGCLASS=X
//*
//READTAPE EXEC PGM=TAPESKIM,PARM='MODE=F,PRINT=(101,10)'
//STEPLIB  DD  DISP=SHR,DSN=SYS1.W$$.LINKLIB
//SYSPRINT DD SYSOUT=*
//TAPE     DD UNIT=(562,,DEFER),VOL=SER=C500MU,
//            LABEL=(,BLP),DISP=(OLD,PASS)
